{
    "doUpdate": true,
    "Hadiths": [
        {
            "speaker": "মুআবিয়াহ (বিন হায়দার) (রাঃ) ",
            "reference": "হাদিস নং ১৮৫০",
            "book": "সুনানে ইবনে মাজাহ",
            "condition": "সহিহ হাদিস",
            "body": "মুআবিয়াহ (বিন হায়দার) (রাঃ) থেকে বর্ণিতঃ এক ব্যক্তি নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-কে জিজ্ঞেস করল, স্বামীর উপর স্ত্রীর কি অধিকার রয়েছে? তিনি বলেন, সে আহার করলে তাকেও (একই মানের) আহার করাবে, সে পরিধান করলে তাকেও একই মানের পোষাক পরিধান করাবে (অথবা তোমাদের ভরণপোষণের সাথে তাদের ভরণপোষণের ব্যবস্থা করবে এবং তোমাদের পোষাক-পরিচ্ছদের ব্যবস্থা করার সাথে তাদের পোষাক-পরিচ্ছদের ও ব্যবস্থা করবে)। কখন ও তার মুখমণ্ডলে আঘাত করবে না, অশ্লীল গালমন্দ করবে না এবং নিজ বাড়ী ছাড়া অন্যত্র তাকে একাকী ত্যাগ করবে না।"
        },
        {
            "speaker": "আবূ হুরায়রা (রাঃ)",
            "reference": "হাদিস নং ১৮৫৮",
            "book": "সুনানে ইবনে মাজাহ",
            "condition": "সহিহ হাদিস",
            "body": "আবূ হুরায়রা (রাঃ) থেকে বর্ণিতঃ রসূলুল্লাহ (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেনঃ চারটি বিষয় বিবেচনায় রেখে মহিলার বিবাহ করা হয়। তার সম্পদ, তার বংশ-মর্যাদা, তার রূপ-সৌন্দর্য্য এবং তার ধর্ম-পরায়ণতা। অতএব তুমি ধর্ম-পরায়ণা নারীর সন্ধান করো। অন্যথায় তোমার দু'হাত ধূলি ধুসরিত হোক।"
        },
        {
            "speaker": "জাবির বিন আবদুল্লাহ (রাঃ)",
            "reference": "হাদিস নং ২১৪৪",
            "book": "সুনানে ইবনে মাজাহ",
            "condition": "সহিহ হাদিস",
            "body": "জাবির বিন আবদুল্লাহ (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, রাসুলুল্লাহ (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেছেন, হে লোকসকল! তোমরা আল্লাহকে ভয় কর এবং উত্তম পন্থায় জীবিকা অন্বেষণ কর। কেননা কোন ব্যক্তিই তার জন্য নির্ধারিত রিযিক পূর্ণরূপে না পাওয়া পর্যন্ত মরবে না, যদিও তার রিযিক প্রাপ্তিতে কিছু বিলম্ব হয়। অতএব তোমরা আল্লাহকে ভয় কর এবং উত্তম পন্থায় জীবিকা অন্বেষণ কর, যা হালাল তাই গ্রহন কর এবং যা হারাম তা বর্জন কর।"
        },
         {
            "speaker": "আবূ হুরায়রা (রাঃ)",
            "reference": "হাদিস নং ১১৭৮",
            "book": "সহিহ বুখারী,",
            "condition": "সহিহ হাদিস",
            "body": "আবূ হুরায়রা (রাঃ) থেকে বর্ণিতঃ

তিনি বলেন, আমার খলীল ও বন্ধু (নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) ) আমাকে তিনটি কাজের ওসিয়্যাত (বিশেষ আদেশ) করেছেন, মৃত্যু পর্যন্ত তা আমি পরিত্যাগ করব না। (তা হল) ১. প্রতি মাসে তিনদিন সিয়াম পালন করা। ২. সালাতুয-যোহা (চাশত এর সালাত আদায় করা)। ৩. বিত্‌র (সালাত) আদায় করে শয়ন করা।"
        },
        
        {
            "speaker": "উবাদাহ ইবনুস সামিত (রাঃ)",
            "reference": "হাদিস নং ২১৫৭",
            "book": "সুনানে ইবনে মাজাহ",
            "condition": "সহিহ হাদিস",
            "body": "উবাদাহ ইবনুস সামিত (রাঃ থেকে বর্ণিতঃ তিনি বলেন, আমি আহলে সুফফার কিছু সংখ্যক লোকদের কুরআন মাজিদ ও লেখা শিখাই। তাঁদের একজন আমাকে একটি ধনুক উপহার দেয়। আমি (মনে মনে) বললাম, এটি তেমন উল্লেখযোগ্য মাল নয়। এটির সাহায্যে আমি আল্লাহ্‌র পথে তীর মারতে পারবো। আমি রাসুলুল্লাহ (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) এর নিকট বিষয়টি সম্পর্কে জিজ্ঞেস করলাম। তিনি বললেন, তোমাকে জাহান্নামের জিঞ্জীর পরানো হলে তাতে তুমি খুশি হতে পারলে এটি গ্রহণ করো"
        },
        {
            "speaker": "ইবনু উমার (রাঃ)",
            "reference": "হাদিস নং ২১৭১",
            "book": "সুনানে ইবনে মাজাহ",
            "condition": "সহিহ হাদিস",
            "body": "ইবনু উমার (রাঃ) থেকে বর্ণিতঃ রাসুলুল্লাহ (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেন, তোমাদের কেউ যেন অপর কারো ক্রয়-বিক্রয়ের উপর ক্রয়-বিক্রয় না করে।"
        },
        {
            "speaker": "আবূ হুরায়রা (রাঃ)",
            "reference": "হাদিস নং ৪৬৬",
            "book": "সুনানে আন-নাসায়ী",
            "condition": "সহিহ হাদিস",
            "body": "আবূ হুরায়রা (রাঃ) থেকে বর্ণিতঃ নবী (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেছেন: কিয়ামতের দিন মানুষের আমলের মধ্যে সর্বপ্রথম সালাতের হিসাব-নিকাশ নেওয়া হবে। যদি সালাত পরিপূর্ণরূপে পাওয়া যায়, তবে তা পরিপূর্ণ লেখা হবে। যদি কিছু কম পাওয়া যায়, তাহলে আল্লাহ্ বলবেন, তার নফল সালাত কিছু আছে কিনা? (যদি থাকে) এগুলোর দ্বারা ফরয সালাতের ক্ষতিপূরণ করে দেওয়া হবে। তারপর অন্যান্য আমলের ক্ষেত্রেও এরূপ করা হবে।"
        },
        {
            "speaker": "আব্দুল্লাহ ইব্‌ন উমর (রাঃ)",
            "reference": "হাদিস নং ১৪৬১",
            "book": "সুনানে আন-নাসায়ী",
            "condition": "সহিহ হাদিস",
            "body": "আব্দুল্লাহ ইব্‌ন উমর (রাঃ) থেকে বর্ণিতঃ রাসূলুল্লাহ (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) থেকে বর্ণিত। তিনি বলেন, কারো মৃত্য অথবা জন্মের কারণে চন্দ্র এবং সূর্য গ্রহণ হয় না, বরং তারা হল আল্লাহর নিদর্শন সমূহের দু’টি নিদর্শন। তাই তোমরা যখন তাদের গ্রহণ দেখবে, তখন সালাত আদায় করবে।"
        },
        {
            "speaker": "উমার (রাঃ)",
            "reference": "হাদিস নং ৩৭৬৮ ",
            "book": "সুনানে আন-নাসায়ী",
            "condition": "সহিহ হাদিস",
            "body": "উমার (রাঃ) থেকে বর্ণিতঃ রাসূলুল্লাহ (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেছেনঃ নিশ্চয়ই আল্লাহ্‌ তা'আলা তোমাদেরকে তোমাদের বাপ-দাদার নামে শপথ করতে নিষেধ করেছেন। উমার (রাঃ) বলেনঃ এরপর আমি আর কখনও এরূপ শপথ করিনি; নিজের থেকেও না এবং অন্যের থেকে বর্ণনাস্বরূপও না।"
        },
        {
            "speaker": "আবদুল্লাহ ইবন আমর (রাঃ)",
            "reference": "হাদিস নং ৪০১১",
            "book": "সুনানে আন-নাসায়ী",
            "condition": "সহিহ হাদিস",
            "body": "আবদুল্লাহ ইবন আমর (রাঃ) সূত্রে রাসূলুল্লাহ (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) থেকে বর্ণিতঃ তিনি বলেনঃ কবীরা গুনাহ হলোঃ আল্লাহর সাথে শরীক করা, পিতামাতার নাফরমানী করা, অন্যায়ভাবে হত্যা করা এবং মিথ্যা কসম করা।"
        },
        {
            "speaker": "আবদুল্লাহ (রাঃ)",
            "reference": "হাদিস নং ৪০১৩",
            "book": "সুনানে আন-নাসায়ী",
            "condition": "সহিহ হাদিস",
            "body": "আবদুল্লাহ (রাঃ) থেকে বর্ণিতঃ তিনি বলেন, আমি বললামঃ ইয়া রাসূলাল্লাহ! সবচাইতে বড় পাপ কোনটি? তিনি বললেনঃ তোমার সৃষ্টিকর্তা আল্লাহপাকের সাথে কাউকে শরীক সাব্যস্ত করা। আমি বললামঃ এরপর কোনটি? তিনি বললেনঃ তোমার সন্তানকে এই ভয়ে হত্যা করা যে, সে তোমার সাথে খাদ্যে শরীক হবে। আমি বললামঃ তারপর কোনটি? তিনি বললেনঃ তোমার প্রতিবেশীর স্ত্রীর সাথে তোমার ব্যভিচারে লিপ্ত হওয়া।"
        },
        {
            "Speaker": "আলক্বামাহ ইব্‌নু ওয়াক্কাস আল-লায়সী (রহঃ)",
            "Reference": "হাদিস নং ১",
            "Book": "সহিহ বুখারী",
            "Condition": "সহিহ হাদিস",
            "Body": "‘আলক্বামাহ ইব্‌নু ওয়াক্কাস আল-লায়সী (রহঃ) থেকে বর্ণিতঃ আমি ‘উমর ইব্‌নুল খাত্তাব (রাঃ)-কে মিম্বারের উপর দাঁড়িয়ে বলতে শুনেছিঃ আমি আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-কে বলতে শুনেছিঃ কাজ (এর প্রাপ্য হবে) নিয়ত অনুযায়ী। আর মানুষ তার নিয়ত অনুযায়ী প্রতিফল পাবে। তাই যার হিজরত হবে ইহকাল লাভের অথবা কোন মহিলাকে বিবাহ করার উদ্দেশ্যে- তবে তার হিজরত সে উদ্দেশ্যেই হবে, যে জন্যে, সে হিজরত করেছে।"
        },
        {
            "Speaker": "উম্মুল মু’মিনীন ‘আয়িশা (রাঃ)",
            "Reference": "হাদিস নং ২",
            "Book": "সহিহ বুখারী",
            "Condition": "সহিহ হাদিস",
            "Body": "উম্মুল মু’মিনীন ‘আয়িশা (রাঃ) থেকে বর্ণিতঃ হারিস ইব্‌নু হিশাম (রাঃ) আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)- কে জিজ্ঞেস করলেন, ‘হে আল্লাহর রসূল! আপনার নিকট ওয়াহী কিরূপে আসে?’ আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বললেনঃ \"কোন কোন সময় তা ঘন্টা বাজার মত আমার নিকট আসে। আর এটি-ই আমার উপর সবচেয়ে বেদনাদায়ক হয় এবং তা শেষ হতেই মালাক (ফেরেশতা) যা বলেন তা আমি মুখস্ত করে নেই, আবার কখনো মালাক মানুষের রূপ ধারণ করে আমার সাথে কথা বলেন। তিনি যা বলেন আমি তা মুখস্ত করে নেই।\" আয়িশা (রাঃ) বলেন, আমি তীব্র শীতের সময় ওয়াহী নাযিলরত অবস্থায় তাঁকে দেখেছি। ওয়াহী শেষ হলেই তাঁর ললাট হতে ঘাম ঝরে পড়ত।"
        },
        {
            "Speaker": "ইয়াহ্‌ইয়া ইবনু ইয়া‘মার (রাঃ)",
            "Reference": "হাদিস নং ২",
            "Book": "সহিহ মুসলিম",
            "Condition": "সহিহ হাদিস",
            "Body": "ইয়াহ্‌ইয়া ইবনু ইয়া‘মার (রাঃ) থেকে বর্ণিতঃ: তিনি বলেন, মা‘বাদ (আল জুহানী) তাকদীর সম্পর্কে তার মত ব্যক্ত করলে আমরা তা অস্বীকার করি। তিনি (ইয়াহ্‌ইয়া ইবনু ইয়া‘মার) বলেন, আমি ও হুমায়দ ইবনু ‘আবদুর রহমান আল হিম্‌ইয়ারী হাজ্জ পালন করতে গিয়েছিলাম। এরপর কাহমাস-এর হাদীসের অনুরূপ সানাদসহ হাদীসটি বর্ণিত আছে। তবে এ বর্ণনায় কিছু বেশ কম রয়েছে।"
        }
    ]
}
